IDEA Open Model
RebarSegment3DBase Class
Compatible with IDEA StatiCa 20.1
 Represents a segment in 3D space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Model.RebarSegment3DBase
 IdeaRS.OpenModel.Model.RebarSegment3DArc3Pts
 IdeaRS.OpenModel.Model.RebarSegment3DLine
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class RebarSegment3DBase : OpenObject
Public MustInherit Class RebarSegment3DBase
	Inherits OpenObject
The RebarSegment3DBase type exposes the following members.
Constructors
Name | Description
RebarSegment3DBase
Initializes a new instance of the RebarSegment3DBase class
Top
Properties
Name | Description
EndPoint
 Gets or sets the endpoint of the segment.
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace